let database = [
  {
    img: "https://static-sl.insales.ru/images/products/1/647/434487943/cover1__w600__3_.jpg",
    title: "Dark Souls: полное издание",
    price: "1999 сом",
    dataId: "0",
    0: {
      description:
        "Войдите в мир Dark Souls; адские пейзажи тайной фантазии, где тьма таит в себе множество ужасов, а мертвые бродят в беспокойстве в поисках искупления.Присоединяйтесь к Фире на её пути, который она прокладывает через землю ужаса и нежити в своем стремлении уничтожить Дракона Андолуса и восстановить порядок в мире, который она когда‑то знала. ",
      count: 10,
    },
  },
  {
    img: "https://static-sl.insales.ru/images/products/1/4203/438644843/pereulok.jpg",
    title: "Переулок",
    price: "840 сом",
    dataId: "1",
    1: {
      description:
        "Войдите в мир Dark Souls; адские пейзажи тайной фантазии, где тьма таит в себе множество ужасов, а мертвые бродят в беспокойстве в поисках искупления.Присоединяйтесь к Фире на её пути, который она прокладывает через землю ужаса и нежити в своем стремлении уничтожить Дракона Андолуса и восстановить порядок в мире, который она когда‑то знала. ",
      count: 10,
    },
  },
  {
    img: "https://static-sl.insales.ru/images/products/1/4398/434516270/2840956_detail.jpg",
    title: "Евангелион АНИМА. Том 1",
    price: "870 сом",
    dataId: "2",
    2: {
      description:
        "Войдите в мир Dark Souls; адские пейзажи тайной фантазии, где тьма таит в себе множество ужасов, а мертвые бродят в беспокойстве в поисках искупления.Присоединяйтесь к Фире на её пути, который она прокладывает через землю ужаса и нежити в своем стремлении уничтожить Дракона Андолуса и восстановить порядок в мире, который она когда‑то знала. ",
      count: 10,
    },
  },
  {
    img: "https://static-sl.insales.ru/images/products/1/4439/424481111/xkPd2FgPVDM.jpg",
    title: "Часы Судного Дня. Книга 1",
    price: "858 сом",
    dataId: "3",
    3: {
      description:
        "Войдите в мир Dark Souls; адские пейзажи тайной фантазии, где тьма таит в себе множество ужасов, а мертвые бродят в беспокойстве в поисках искупления.Присоединяйтесь к Фире на её пути, который она прокладывает через землю ужаса и нежити в своем стремлении уничтожить Дракона Андолуса и восстановить порядок в мире, который она когда‑то знала. ",
      count: 10,
    },
  },
  {
    img: "https://static-sl.insales.ru/images/products/1/6356/424376532/4p6lp9ILxlQ.jpg",
    title: "The Sandman. Песочный человек. Увертюра",
    price: "932 сом",
    dataId: "4",
    4: {
      description:
        "Войдите в мир Dark Souls; адские пейзажи тайной фантазии, где тьма таит в себе множество ужасов, а мертвые бродят в беспокойстве в поисках искупления.Присоединяйтесь к Фире на её пути, который она прокладывает через землю ужаса и нежити в своем стремлении уничтожить Дракона Андолуса и восстановить порядок в мире, который она когда‑то знала. ",
      count: 10,
    },
  },
  {
    img: " https://static-sl.insales.ru/images/products/1/6046/440162206/skott-piligrim-kollekcionnoe-izdanie-tom-1.jpg",
    title: "Скотт Пилигрим. Полное издание. Том 1",
    price: "1100 сом",
    dataId: "5",
    5: {
      description:
        "Войдите в мир Dark Souls; адские пейзажи тайной фантазии, где тьма таит в себе множество ужасов, а мертвые бродят в беспокойстве в поисках искупления.Присоединяйтесь к Фире на её пути, который она прокладывает через землю ужаса и нежити в своем стремлении уничтожить Дракона Андолуса и восстановить порядок в мире, который она когда‑то знала. ",
      count: 10,
    },
  },
  {
    img: "https://static-sl.insales.ru/images/products/1/7055/417938319/SMGAUNT_cov-1.jpg",
    title: "Удивительный Человек-паук. Вызов. Том 1",
    price: "1400 сом",
    dataId: "6",
    6: {
      description:
        "Войдите в мир Dark Souls; адские пейзажи тайной фантазии, где тьма таит в себе множество ужасов, а мертвые бродят в беспокойстве в поисках искупления.Присоединяйтесь к Фире на её пути, который она прокладывает через землю ужаса и нежити в своем стремлении уничтожить Дракона Андолуса и восстановить порядок в мире, который она когда‑то знала. ",
      count: 10,
    },
  },
  {
    img: "https://static-sl.insales.ru/images/products/1/2746/440167098/38a930_5cbced02d9724b7db2c248062876500e_mv2.jpg",
    title: "Продукты 24. Грандиозное издание",
    price: "390 сом",
    dataId: "7",
    7: {
      description:
        "Войдите в мир Dark Souls; адские пейзажи тайной фантазии, где тьма таит в себе множество ужасов, а мертвые бродят в беспокойстве в поисках искупления.Присоединяйтесь к Фире на её пути, который она прокладывает через землю ужаса и нежити в своем стремлении уничтожить Дракона Андолуса и восстановить порядок в мире, который она когда‑то знала. ",
      count: 10,
    },
  },

  {
    img: "https://static-sl.insales.ru/images/products/1/4439/424481111/xkPd2FgPVDM.jpg",
    title: "Часы Судного Дня. Книга 1",
    price: "858 сом",
    dataId: "8",
    8: {
      description:
        "Войдите в мир Dark Souls; адские пейзажи тайной фантазии, где тьма таит в себе множество ужасов, а мертвые бродят в беспокойстве в поисках искупления.Присоединяйтесь к Фире на её пути, который она прокладывает через землю ужаса и нежити в своем стремлении уничтожить Дракона Андолуса и восстановить порядок в мире, который она когда‑то знала. ",
      count: 10,
    },
  },
  {
    img: "https://static-sl.insales.ru/images/products/1/3705/289246841/duh-moey-obshchagi.jpg",
    title: "Дух моей общаги",
    price: "350 сом",
    dataId: "9",
    9: {
      description:
        "Войдите в мир Dark Souls; адские пейзажи тайной фантазии, где тьма таит в себе множество ужасов, а мертвые бродят в беспокойстве в поисках искупления.Присоединяйтесь к Фире на её пути, который она прокладывает через землю ужаса и нежити в своем стремлении уничтожить Дракона Андолуса и восстановить порядок в мире, который она когда‑то знала. ",
      count: 10,
    },
  },
  {
    img: " https://static-sl.insales.ru/images/products/1/176/342327472/n2miRgUJIJ0.jpg",
    title: "Госпожа Кагуя: Любовная битва двух гениев. Книга 1",
    price: "1100 сом",
    dataId: "10",
    10: {
      description:
        "Войдите в мир Dark Souls; адские пейзажи тайной фантазии, где тьма таит в себе множество ужасов, а мертвые бродят в беспокойстве в поисках искупления.Присоединяйтесь к Фире на её пути, который она прокладывает через землю ужаса и нежити в своем стремлении уничтожить Дракона Андолуса и восстановить порядок в мире, который она когда‑то знала. ",
      count: 10,
    },
  },
  {
    img: "https://static-sl.insales.ru/images/products/1/2467/438634915/243234.750.jpg",
    title: "Топ Сикрет. Зона 52",
    price: "390 сом",
    dataId: "11",
    11: {
      description:
        "Войдите в мир Dark Souls; адские пейзажи тайной фантазии, где тьма таит в себе множество ужасов, а мертвые бродят в беспокойстве в поисках искупления.Присоединяйтесь к Фире на её пути, который она прокладывает через землю ужаса и нежити в своем стремлении уничтожить Дракона Андолуса и восстановить порядок в мире, который она когда‑то знала. ",
      count: 10,
    },
  },
];

const product = document.querySelector(".product");

// document.addEventListener("click", (event) => {
//   if (event.target.classList.contains("carad__inner-img")) {
//     const eventId = event.target.dataset.id;

//     console.log(eventId);
//     singlePage(eventId);

//     product.innerHTML = singlePage(eventId);
//   }
// });


const getSelected = localStorage.getItem('selected')
console.log(getSelected);

product.innerHTML = singlePage(getSelected)

function singlePage(id) {
  const singleObj = database[id];
  // log
  console.log(singleObj);
  console.log(singleObj.img);
  console.log(singleObj[id].description);

  return `
    <div class="container">
        <div class="product__inner">
            <div class="product__left">
                <img  class="product__left-img" src="${singleObj.img}"
                    alt="comics">
            </div>
  
            <div class="product__right">
                <h3 class="product__right-text">${singleObj.title}</h3>
                <p class="product__right-title">Описание:</p>
                <p class="product__right-dicription">
                ${singleObj[id].description}
                </p>
  
                <h5 class="product__right-price">${singleObj.price}</h5> 
  
                <div class="product__rating">
                    1 2 3 4 5
                </div>
                <button class="product__cart">
                    В КОРЗИНУ
                </button>
            </div>
        </div>
    </div>
    `;
}
